In [5]:
#Consider following code to answer further questions:

#import pandas as pd
#course_name = [‘Data Science’, ‘Machine Learning’, ‘Big Data’, ‘Data Engineer’]
#duration = [2,3,6,4]
#df = pd.DataFrame(data = {‘course_name’ : course_name, ‘duration’ : duration})

In [6]:
#Q1. Write a code to print the data present in the second row of the dataframe, df.

In [7]:
import pandas as pd
course_name = ["Data Science", "Machine Learning", "Big Data", "Data Engineer"]
duration = [2,3,6,4]
data = {"course_name" : course_name, "duration" : duration}
df = pd.DataFrame(data)

In [8]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [9]:

#to print values present in 2nd row
df.iloc[1:2]

        course_name  duration
1  Machine Learning         3

In [10]:
#Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?
#iloc: iloc is primarily used for integer-based indexing, allowing you to select rows and columns by their integer positions. It uses zero-based integer indexing, meaning the first row or column has the index 0, the second has index 1, and so on. The syntax for iloc is df.iloc [ row_index, column_index ] . You can use single integers, lists of integers, or slices to specify the rows and columns you want to select. the slicing takes upper limit - 1 value

#loc: loc is used for label-based indexing, allowing you to select rows and columns by their labels or index names. It uses the actual row and column labels (not their integer positions) to perform the selection. The syntax for loc is df.loc[ row_label, column_label ]. You can use single labels, lists of labels, or slices to specify the rows and columns you want to select. the slicing takes upper limit value

In [11]:
df.iloc[0:3]

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [12]:

df.loc[0:3]

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [13]:
df.iloc[0:3,[0]]

        course_name
0      Data Science
1  Machine Learning
2          Big Data

In [14]:

df.loc[0:3,['course_name']]

        course_name
0      Data Science
1  Machine Learning
2          Big Data
3     Data Engineer

In [15]:
#Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df then find the output for both new_df.loc[2] and new_df.iloc[2].
#Did you observe any difference in both the outputs? If so then explain it.
#Consider the below code to answer further questions:

import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [17]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [18]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.911742  0.298912  0.531646  0.752207  0.858964  0.301520
2  0.966826  0.157887  0.626309  0.408813  0.415219  0.915270
3  0.566075  0.128610  0.639662  0.339372  0.104308  0.276443
4  0.258422  0.086340  0.207399  0.800825  0.201666  0.577490
5  0.928539  0.137033  0.604739  0.972780  0.874485  0.852043
6  0.461497  0.970183  0.995966  0.073790  0.274450  0.549326

In [19]:
reindex = [3,0,1,2]
new_df = df1.reindex(reindex)

In [20]:

new_df

   column_1  column_2  column_3  column_4  column_5  column_6
3  0.566075  0.128610  0.639662  0.339372  0.104308  0.276443
0       NaN       NaN       NaN       NaN       NaN       NaN
1  0.911742  0.298912  0.531646  0.752207  0.858964  0.301520
2  0.966826  0.157887  0.626309  0.408813  0.415219  0.915270

In [21]:
new_df.loc[2]

column_1    0.966826
column_2    0.157887
column_3    0.626309
column_4    0.408813
column_5    0.415219
column_6    0.915270
Name: 2, dtype: float64

In [22]:
new_df.iloc[2]

column_1    0.911742
column_2    0.298912
column_3    0.531646
column_4    0.752207
column_5    0.858964
column_6    0.301520
Name: 1, dtype: float64

In [23]:

pd.DataFrame(new_df.loc[2])

                 2
column_1  0.966826
column_2  0.157887
column_3  0.626309
column_4  0.408813
column_5  0.415219
column_6  0.915270

In [24]:
pd.DataFrame(new_df.iloc[2])

                 1
column_1  0.911742
column_2  0.298912
column_3  0.531646
column_4  0.752207
column_5  0.858964
column_6  0.301520

In [25]:
#Q4. Write a code to find the following statistical measurements for the above dataframe df1:
#(i) mean of each and every column present in the dataframe.
#(ii) standard deviation of column, ‘column_2’

In [26]:

df1.describe()

       column_1  column_2  column_3  column_4  column_5  column_6
count  6.000000  6.000000  6.000000  6.000000  6.000000  6.000000
mean   0.682184  0.296494  0.600953  0.557964  0.454848  0.578682
std    0.295353  0.337891  0.252142  0.338596  0.334813  0.267226
min    0.258422  0.086340  0.207399  0.073790  0.104308  0.276443
25%    0.487641  0.130716  0.549919  0.356732  0.219862  0.363471
50%    0.738909  0.147460  0.615524  0.580510  0.344834  0.563408
75%    0.924340  0.263656  0.636324  0.788670  0.748028  0.783405
max    0.966826  0.970183  0.995966  0.972780  0.874485  0.915270

In [27]:

df1.mean()

column_1    0.682184
column_2    0.296494
column_3    0.600953
column_4    0.557964
column_5    0.454848
column_6    0.578682
dtype: float64

In [28]:
df1[['column_1','column_2']].std()

column_1    0.295353
column_2    0.337891
dtype: float64

In [29]:
pd.DataFrame(df1[['column_1','column_2']].std())

                 0
column_1  0.295353
column_2  0.337891

In [30]:
#Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the mean of column, column_2. If you are getting errors in executing it then explain why.
#[Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]

In [31]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.911742  0.298912  0.531646  0.752207  0.858964  0.301520
2  0.966826  0.157887  0.626309  0.408813  0.415219  0.915270
3  0.566075  0.128610  0.639662  0.339372  0.104308  0.276443
4  0.258422  0.086340  0.207399  0.800825  0.201666  0.577490
5  0.928539  0.137033  0.604739  0.972780  0.874485  0.852043
6  0.461497  0.970183  0.995966  0.073790  0.274450  0.549326

In [32]:

df1.iloc[1,0:2]

column_1    0.966826
column_2    0.157887
Name: 2, dtype: float64

In [33]:

df1.iloc[1,0:2] = "dani"

In [34]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.911742  0.298912  0.531646  0.752207  0.858964  0.301520
2      dani      dani  0.626309  0.408813  0.415219  0.915270
3  0.566075   0.12861  0.639662  0.339372  0.104308  0.276443
4  0.258422   0.08634  0.207399  0.800825  0.201666  0.577490
5  0.928539  0.137033  0.604739  0.972780  0.874485  0.852043
6  0.461497  0.970183  0.995966  0.073790  0.274450  0.549326

In [35]:
df1.loc[:,["column_1","column_2"]]

   column_1  column_2
1  0.911742  0.298912
2      dani      dani
3  0.566075   0.12861
4  0.258422   0.08634
5  0.928539  0.137033
6  0.461497  0.970183

In [36]:
df1.loc[:,["column_1","column_2"]].mean()

/tmp/ipykernel_2557/374022466.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.loc[:,["column_1","column_2"]].mean()

Series([], dtype: float64)

In [37]:
print("The error is : \n")
print("The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning. df1.loc[:,['column_1','column_2']].mean()")

The error is :

The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning. df1.loc[:,['column_1','column_2']].mean()

In [40]:
#Q7. Write a code to print only the current month and year at the time of answering this question.
 #[Hint: Use pandas.datetime function]

In [41]:

current = pd.Timestamp.now()

In [42]:

current

Timestamp('2024-02-12 13:18:37.731743')

In [43]:

type(current)

pandas._libs.tslibs.timestamps.Timestamp

In [44]:
month = current.month

In [45]:

year = current.year

In [46]:
print("Current Month : {}".format(month))
print("Current Year : {}".format(year))

Current Month : 2
Current Year : 2024

In [47]:
#Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and calculates the difference between them in days, hours, and minutes using Pandas time delta. The program should prompt the user to enter the dates and display the result.

In [48]:
def time_difference_func(start_date, end_date):
    
    try:
        start_timestamp = pd.Timestamp(start_date)
        end_timestamp = pd.Timestamp(end_date)
    
        time_difference = end_timestamp - start_timestamp

        # Extract days, hours, and minutes from the timedelta
        days = time_difference.days
        hours = time_difference.seconds // 3600
        minutes = (time_difference.seconds % 3600) // 60
        return days, hours, minutes
    except Exception as e:
        print(f"Error: {e}")


# Prompt the user to enter two dates in the format YYYY-MM-DD
start_date_input = input("Enter the start date (YYYY-MM-DD): ")
end_date_input = input("Enter the end date (YYYY-MM-DD): ")


days_diff, hours_diff, minutes_diff = time_difference_func(start_date_input, end_date_input)

print(f"Time difference: {days_diff} days, {hours_diff} hours, and {minutes_diff} minutes.")

Enter the start date (YYYY-MM-DD):  2022
Enter the end date (YYYY-MM-DD):  2023.11.10

Time difference: 678 days, 0 hours, and 0 minutes.

In [49]:
#Q9. Write a Python program that reads a CSV file containing categorical data and converts a specified column to a categorical data type. The program should prompt the user to enter the file path, column name, and category order, and then display the sorted data.

In [50]:
data = pd.DataFrame({"Name":["Rachit","Yomil","Jayan","Pratham","Malik","Sam","Khushi","Sakshi"] , "Gender":['M','M','M','M','M','M','F','F'],"Grade":['A','B','A','B','C','C','A','C']})

data.to_csv("marks.csv",index=False)

In [51]:
def convert_to_categorical_and_sort(file_path, column_name, category_order):
    try:
        df = pd.read_csv(file_path)
        df[column_name] = pd.Categorical(df[column_name], categories=category_order, ordered=True)
        sorted_df = df.sort_values(by=column_name)
        return sorted_df
    except Exception as e :
        print(f"Error: {e}")


if __name__ == "__main__":
    file_path = input("Enter the CSV file path: ")
    column_name = input("Enter the column name to convert to categorical: ")
    category_order = input("Enter the category order (comma-separated values): ")
    category_order = [cat.strip() for cat in category_order.split(",")]

    sorted_data = convert_to_categorical_and_sort(file_path, column_name, category_order)
    print("\nSorted Data:")
    print(sorted_data)

Enter the CSV file path:  sorted data
Enter the column name to convert to categorical:  3
Enter the category order (comma-separated values):  ,

Error: [Errno 2] No such file or directory: 'sorted data'

Sorted Data:
None

In [52]:
#Q10. Write a Python program that reads a CSV file containing sales data for different products and visualizes the data using a stacked bar chart to show the sales of each product category over time. The program should prompt the user to enter the file path and display the chart.

In [53]:
data = pd.DataFrame({"Date":["20-07-2023","20-07-2023","20-07-2023","21-07-2023","21-07-2023","22-07-2023","23-07-2023","24-07-2023"] , "Product Category":['TV','Fridge','Washing Machine','Washing Machine','TV','Fridge','TV','Washing Machine'],"Units Sold":['44','20','18','50','30','35','42','54']})

data.to_csv("salesdata.csv",index=False)

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt

def visualize_sales_data(file_path):
    try:
        # Read the CSV file into a pandas DataFrame
        df = pd.read_csv(file_path)

        # Convert the 'Date' column to datetime
        df['Date'] = pd.to_datetime(df['Date'],dayfirst=True)

        # Group the data by product category and date, and sum the sales
        grouped_data = df.groupby(['Product Category', 'Date']).sum().reset_index()
        
        # Pivot the data to create a matrix of sales by product and date
        df_pivot = grouped_data.pivot(index='Date', columns='Product Category', values='Units Sold')

        # Plot stacked barchart overtime
        df_pivot.plot(kind='bar',
                  stacked=True,
                  title='Sales of Each Product Category Over Time', 
                  xlabel='Date',
                  ylabel='Units Sols',
                  figsize=(12,6))
        plt.legend(title='Product Category')
        plt.show()

    except Exception as e:
        print(f"Error: {e}")

if __name__ == "__main__":
    file_path = input("Enter the file path of the CSV file containing sales data: ")
    visualize_sales_data(file_path)